zwpa_app/app/controllers/audits_controller.rb

    def set_audit
      @audit = Audit.find(params[:id])
---
SELECT  "audits".* FROM "audits"  WHERE "audits"."id" = $1 LIMIT 1