zwpa_app/app/controllers/requests_controller.rb

SELECT "walkthroughs".* FROM "walkthroughs"  WHERE "walkthroughs"."request_id" = $1
SELECT "audits".* FROM "audits"  WHERE "audits"."request_id" = $1
---
  def show
    @walkthroughs = @request.walkthroughs.to_a
    @audits = @request.audits.to_a