zwpa_app/app/controllers/wastes_controller.rb

SELECT  "wastes".* FROM "wastes"  WHERE "wastes"."id" = $1 LIMIT 1
---
    def set_waste
      @waste = Waste.find(params[:id])